app/controllers/api/base_products_controller.rb

INSERT INTO "base_products" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "adadadsa"], ["created_at", "2015-08-25 19:14:57.193973"], ["updated_at", "2015-08-25 19:14:57.193973"]]
---
  def create
    @base_product = BaseProduct.create base_product_params

SELECT "base_products".* FROM "base_products"
---
  def set_base_product
    @base_product = BaseProduct.find params[:id]