app/controllers/api/delayed_jobs_controller.rb

SELECT "delayed_jobs".* FROM "delayed_jobs"
---
  def index
    respond_with(DelayedJob.all)